// Операнд – то, к чему применяется оператор.
// Унарным - называется оператор, который применяется к одному операнду.
// Бинарным - называется оператор, который применяется к двум операндам.

// *** атематические операторы ***
// Сложение +,
// Вычитание -,
// Умножение *,
// Деление /,
// Взятие остатка от деления %,
// Возведение в степень **.


// *** Операторы сравнения ***
// Больше/меньше: a > b, a < b.
// Больше/меньше или равно: a >= b, a <= b.
// Равно: a == b или a === b.
// Не равно a != b или a !== b.


// *** Логические операторы ***
// || (ИЛИ)
// ||= (Оператор логического присваивания ИЛИ)
// && (И)
// &&= (Оператор логического присваивания И)
// ! (НЕ)
// ?? (Оператор нулевого слияния)
// ??= (Оператор нулевого присваивания)


// *** Тернарный оператор ***
// условие ? (выполняемый код если true) : (выполняемый код если false)


// Таблица приоритетов
// https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Operator_Precedence
