// ***  Обьявление переменных в JS ***
// let name = 'ivan' - если переменная будет изменена
// const age = 18 - если переменная меняться не будет
// var - формат ES5 (Не используеться)


// *** Вариант названий папок и файлов ***
// 1) snake_case
// 2) Kebab-case
// 3) PascaleCase
// Вариант названий переменных
// 1) UPPER_SNAKE_CASE => вид константы которые нельзя переопределять
// 2) _nameParam => руками не трогать
// 3) lowerCamelCase => верблюжий регистр


//  *** Всего основных типов данных 8 ***
/*
 * 1. Number
 * 2. String
 * 3. Boolean
 * 4. Null
 * 5. Undefined
 * 6. Symbol
 * 7. Bigint
 * 8. Object
 * */

// *** Object делитться на две категории ***
/*
 * 1. Обичные обьекты {}
 * 2. Array[],
 *  - function,
 *  - регулярные выражение,
 *  - Обьект
 *  - Даты,
 *  - Ошибки
 */
