//  •	Какое будет выведено значение: let x = 5; alert( x++ ); ? ==> 5 a если было бы ++x то было бы 6
//  •	Чему равно такое выражение: [ ] + false - null + true ?  ==> NaN
// 	•	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? ==> 2
// 	•	Чему равна сумма [ ] + 1 + 2? ==> 12 строка [] === '' true
// 	•	Что выведет этот код: alert( "1"[0] )?  ==> 1
// 	•	Чему равно 2 && 1 && null && 0 && undefined ? ==> null
// 	•	Есть ли разница между выражениями? !!( a && b ) и (a && b)? ==> да в первом вернет boolean во втором a или b
// 	•	Что выведет этот код: alert( null || 2 && 3 || 4 ); ? ==> 3
// 	•	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? ==> false (ссылаються на два разных массива)
// 	•	Что выведет этот код: alert( +"Infinity" ); ? ==> 'Infinity' typeof 'number'
// 	•	Верно ли сравнение: "Ёжик" > "яблоко"? ==> false
// 	•	Чему равно 0 || "" || 2 || undefined || true || falsе ? ==> 2
